# TMDF Movies Analysis MySQL Database

## Imports

In [1]:
# imports
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()

connection_str = "mysql+pymysql://root:root@localhost/movies"

In [2]:
engine = create_engine(connection_str)

In [4]:
create_database(connection_str)

In [3]:
database_exists(connection_str)

True

In [4]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [5]:
basics_df = pd.read_csv('Data/title_basics.csv.gz')
basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0094859,movie,Chief Zabu,Chief Zabu,0,2016,NaN,74,Comedy
...,...,...,...,...,...,...,...,...,...
82145,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama
82146,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy"
82147,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
82148,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
82149,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"

## Normalize and Transform Columns

- Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:

 - tconst
 - genre_id

In [6]:
basics_df["genre_split"] = basics_df["genres"].str.split(",")
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0094859,movie,Chief Zabu,Chief Zabu,0,2016,NaN,74,Comedy,[Comedy]

In [7]:
genre_exploded = basics_df.explode('genre_split')
genre_exploded

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
82148,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
82148,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
82148,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
82149,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
82149,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [8]:
genre_split = genre_exploded["genres"].str.split(",")
genre_split

0           [Comedy, Fantasy, Romance]
0           [Comedy, Fantasy, Romance]
0           [Comedy, Fantasy, Romance]
1                              [Drama]
2                              [Drama]
                     ...
82148    [Action, Adventure, Thriller]
82148    [Action, Adventure, Thriller]
82148    [Action, Adventure, Thriller]
82149                 [Drama, History]
82149                 [Drama, History]
Name: genres, Length: 153457, dtype: object

In [9]:
unique_genre = genre_split.explode().unique()
unique_genre

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Mystery', 'Musical', 'Action', 'Adventure', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'War', 'Biography',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [10]:
## get the unique genres and sorting A-Z
unique_genre = sorted(genre_exploded['genre_split'].unique())
unique_genre

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [11]:
# instantiating title_genre and copying
title_genres = genre_exploded[["tconst", "genre_split"]].copy()
title_genres.head()

      tconst genre_split
0  tt0035423      Comedy
0  tt0035423     Fantasy
0  tt0035423     Romance
1  tt0062336       Drama
2  tt0069049       Drama

In [12]:
# making integers for each genre id (unique)
genre_ids = range(len(unique_genre))

# zipping genre unique_ids and pairing it
genre_id_map = dict(zip(unique_genre, genre_ids)) 

# checking and displaying array
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [13]:
# mapping
title_genres["genre_id"] = title_genres["genre_split"].map(genre_id_map)
title_genres = title_genres.drop(columns = "genre_split")

In [14]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153457 entries, 0 to 82149
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153457 non-null  object
 1   genre_id  153457 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [15]:
# view title_genres table
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [ ]:
# genre lookup table
genres = pd.DataFrame({"genre_name": genre_id_map.keys(), 
                             "genre_id": genre_id_map.values()})
# view genres table
genres.head()

In [17]:
# check genres info
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

## Discarding Unneccessary Info

In [20]:
basics_df.drop(columns=['titleType', 'originalTitle', 'isAdult', 'genres', 'genre_split'], inplace = True)

In [21]:
basics_df.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0094859,Chief Zabu,2016,NaN,74

## Saving MySQL tables with tconst as Primary Key

In [26]:
## get max string length
max_str_len = basics_df['tconst'].fillna('').map(len).max()
max_str_len

10

In [27]:
## imports
from sqlalchemy.types import *

# calculate max string lengths for each object columns
key_len = basics_df['tconst'].fillna('').map(len).max()
title_len = basics_df['primaryTitle'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [29]:
# saving to sql with dtype and index=False
basics_df.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

82150

In [30]:
# setting tconst as primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')